{
    "class_name": "Functional", 
    "config": {
        "name": "model", 
        "trainable": true, 
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [null, 784], 
                    "dtype": "float32", 
                    "sparse": false, 
                    "ragged": false, 
                    "name": "input_1"
                    }, 
                "name": "input_1", 
                "inbound_nodes": []
            }, 
            {
                "class_name": "Dense", 
                "config": 
                {
                    "name": "dense", 
                    "trainable": true, 
                    "dtype": "float32", "units": 256, 
                    "activation": "relu", 
                    "use_bias": true, 
                    "kernel_initializer": 
                    {
                        "class_name": "GlorotUniform", 
                        "config": {"seed": null}
                    }, 
                    "bias_initializer": 
                    {
                        "class_name": "Zeros", "config": {}
                    }, 
                    "kernel_regularizer": 
                    {
                        "class_name": "L2", 
                        "config": {"l2": 9.999999747378752e-05}
                    }, 
                    "bias_regularizer": null, 
                    "activity_regularizer": null, 
                    "kernel_constraint": null, 
                    "bias_constraint": null
                }, 
                "name": "dense", 
                "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.050000000000000044, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.050000000000000044, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}